{
  "title": "Trying to find my flow",
  "date": "Monday May 18th, 2020",
  "thumbnail": "/images/uploads/bael-big.jpg",
  "body": "This template was a great find. Netlify is a great service. Yet, I am not here to tell you about these things because you can read about them for yourself. This is a space for me to figure out the best possible way to share my knowledge and interests with the public. The goal is to be placed in the best group of colleagues to enhance our world and ourselves. Topics I will need to more narrowly define. Along the way of sharing I hope learn more about nuxt and services like netlify. Currently there is new uproar about deno.js vs nodejs and frankly I find it all to be click-baity, fad-shifting, tree-shaking hoopla but I will go deeper on that opinion in another post. I am here to state that I am looking for a smooth workflow that keeps me active in updating content, improving my skills, and deepening my knowledge.  I will have categories that are playful and serious. I will figure out a format that I like and attempt to remain consistent. I like typing because it improves those skills but I grew up writing. While I type I do not see a wordcount so that might be helpful to my flow. A skill could be adding that to the cms and sharing that. Also the draft stage. I do not know if I saw that in the cms or wordpress but that would be necessary. Images... Audio... fluidity... how am I going to do that?  \n\n**Bael is a free template that gives you an easy way to start a blog that uses modern technologies like static-site JAMstack architecture, CSS grid layout, responsive design, a serverless function that handles emails newsletter signup with Sendgrid, and fuzzy search — all wrapped up in a brutalist aesthetic.**\n\nBael runs using [Nuxt.js](https://nuxtjs.org), [Vue.js](https://vuejs.org), [Netlify CMS](https://netlifycms.org), and is hosted by [Netlify](https://netlify.com). Bael requires an account with Netlify and Github/Gitlab to deploy. A free Sendgrid account and API key is needed to setup the email newsletter signup.\n\nMade by [jake101](https://jake101.com)",
  "category": "Setup"
}